IDEA Open Model
ConcreteSLSCheckResultStiffnessEc2 Class
Compatible with IDEA StatiCa 20.1
 SLS Check Stiffness Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultStiffness
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultStiffnessEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ConcreteSLSCheckResultStiffnessEc2 : ConcreteSLSCheckResultStiffness
Public Class ConcreteSLSCheckResultStiffnessEc2
	Inherits ConcreteSLSCheckResultStiffness
The ConcreteSLSCheckResultStiffnessEc2 type exposes the following members.
Constructors
Name | Description
ConcreteSLSCheckResultStiffnessEc2
Initializes a new instance of the ConcreteSLSCheckResultStiffnessEc2 class
Top
Properties
Name | Description
Fr
 crack resistance internal forces
 (Inherited from ConcreteSLSCheckResultStiffness.)
CharacteristicsI
 stiffnesses calculated on uncracked cross-section
 (Inherited from ConcreteSLSCheckResultStiffness.)
CharacteristicsII
 stiffnesses calculated on cracked cross-section
 (Inherited from ConcreteSLSCheckResultStiffness.)
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
LinearStiffness
 linear stiffnesses
 (Inherited from ConcreteSLSCheckResultStiffness.)
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Stiffness
 result stiffnesses
 (Inherited from ConcreteSLSCheckResultStiffness.)
StiffnessI
 stiffnesses calculated on uncracked cross-section
 (Inherited from ConcreteSLSCheckResultStiffness.)
StiffnessII
 stiffnesses calculated on fully-cracked cross-section
 (Inherited from ConcreteSLSCheckResultStiffness.)
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace